{
    "preamble": {
        "Prep Time": "20 minutes",
        "Cook Time": "25 minutes",
        "Total Time": "45 minutes"
    },
    "ingredients": [
        "1-2 tablespoons olive oil (optional)",
        "1 pound (16 ounces) smoked sausage (coined)",
        "5 slices center cut bacon",
        "1 shallot, diced (1/2 cup)",
        "2 cloves garlic, minced (1 tablespoon)",
        "1/2 tablespoon EACH: dried basil, dried oregano leaves, garlic powder",
        "1/2 teaspoon EACH onion powder, dried thyme",
        "1 and 1/2 cups chicken stock, (separated)",
        "1 medium cabbage, quartered and cut into 1/2-inch pieces (8 cups)",
        "8 ounces baby carrots, halved (1-3/4 cup)",
        "1 and 1/2 pounds baby red potatoes, quartered. (~5 cups)",
        "Fine sea salt and freshly cracked pepper",
        "Parmesan cheese OR dijonaise (see below)",
        "1/4 cup fresh flat leaf parsley, finely chopped"
    ],
    "instructions": [
        "Start by coining the sausage and then place into a large heavy bottomed pot. IF using turkey sausage, I find you need a bit of olive oil in the pot. Use as needed. Brown the sausage over medium high heat, set aside, and drain any oil in the pot. Return pot to burner. Add in the bacon and cook to desired crispiness. Remove to a paper towel lined plate and leave the grease in the pot. When the bacon has cooled, crumble/coarsely chop it.",
        "In a small bowl, toss together the seasonings: the dried basil, dried oregano, garlic powder, onion powder, thyme, and red pepper flakes. Add salt and pepper as well (I add about 1/2 teaspoon each, add to desired preference).",
        "To the pot (over medium heat), add the shallot and cook for 2-3 minutes. Add in the garlic and cook until fragrant, about 30 seconds. Stir in half of the seasoning mix. Stir for another 30 seconds to a minute and then add in 1/2 cup (112g) stock. Scrape any browned bits from the bottom of the pot and then add in the chopped cabbage and remaining 1 cup (232g) stock. Stir and then cover the pot. Increase heat to medium-high. Let cook, covered, stirring occasionally for 8-10 minutes. At this time the cabbage should be very cooked down and starting to get pretty tender.",
        "Remove the lid and then directly on top of the cabbage, place the quartered red potatoes, and halved baby carrots. Add the remaining seasoning mix on top and do not stir. Cover the pot (still medium-high heat) and let cook for 18-23 minutes or until potatoes are fork tender. Check occasionally and if needed, add up to 1/2 cup additional stock (if all has evaporated from the pot which will vary depending on your pot and heat of stove; there needs to be some amount of liquid so the bottom doesn't burn and the veggies properly steam).",
        "Once potatoes and carrots are fork tender, and stock has all been cooked into the dish, add in the sausage. Stir everything together and season again with salt and pepper to taste (Remember the bacon will add some saltiness but the vegetables do need a good amount of salt!). Add crumbled bacon to individual plates. Serve individual plates with fresh parsley."
    ],
    "credit": "https://www.chelseasmessyapron.com/one-pot-sausage-cabbage-potatoes-dinner/"
}