{
    "preamble": {
        "Prep Time": "1 hour",
        "Cook Time": "10 minutes",
        "Total Time": "1 hour 10 minutes"
    },
    "sections": {
        "cream topping": {
            "ingredients": [
                "1 cup heavy cream",
                "3 tbsp powdered sugar",
                "1/2 cup of spent coffee grounds"
            ],
            "instructions": [
                "For the whipped topping: Combine 1/2 cup coffee grounds and 1 cup heavy cream in a container with a lid (like a glass jar) and refrigerate to infuse the flavor—2 hours if you're impatient, or up to 12 if you've got time to burn.",
                "Strain the cream, using cheesecloth or a super-fine mesh sieve, and discard the grounds. Add the powdered sugar to the cream, whip until soft peaks form, and refrigerate until needed."            ]
        },
        "crust": {
            "ingredients": [
                "2 cups crushed chocolate cookies",
                "4 tablespoons unsalted butter, melted",
                "1/4 cup spent coffee grounds"
            ],
            "instructions": [
                "For the crust: Heat the oven to 375° F.",
                "In a medium bowl, mix together the crushed cookie crumbs and the remaining 1/4 cup coffee grounds, then drizzle in the melted butter and stir to coat everything in butter (it might not clump at all, that's okay!).",
                "Dump the buttery crumbs into the pie plate and press to form an even crust. (I like to use a measuring cup to do this, but fingers work, too). Place the pie plate in the freezer while you wait for the oven to finish heating up.",
                "Bake the crust for 10 minutes, then set aside to cool."
            ]
        },
        "filling": {
            "ingredients": [
                "½ cup heavy cream",
                "5 ounces semi-sweet chocolate",
                "12 tablespoons (1 1/2 sticks) unsalted butter, softened",
                "¾ cup granulated sugar",
                "1 teaspoon vanilla extract",
                "4 large eggs"
            ],
            "instructions": [
                "For the filling: Whip the 1/2 cup heavy cream until soft peaks form, then cover and refrigerate the whipped cream until needed.",
                "Melt the chocolate in a microwave or with a double boiler, and set aside to cool slightly.",
                "Add the butter and sugar to the bowl of a stand mixer fitted with the whisk attachment, and cream until light and fluffy, about 3 minutes.",
                "Add in the cooled chocolate and vanilla and whisk again until combined.",
                "Add the eggs, one at a time, beating for 5 minutes after each addition, and then fold in the reserved plain whipped cream.",
                "Pour the filling into cooled crust, spread it out, then top with the coffee-flavored whipped cream. Refrigerate to set, at least 2 hours or overnight"
            ]
        }
    },
    "credit": "Kenneth Cain"
}