{
    "preamble": {
        "Prep Time": "15 minutes",
        "Cook Time": "30 minutes",
        "Proving Time": "30 minutes",
        "Total Time": "1 hour 45 minutes"
    },
    "ingredients": [
        "400g Gluten free flour",
        "1 tsp Xanthum gum",
        "300ml Warm water",
        "2 tbsp Caster sugar",
        "14g Dried yeast",
        "1 tsp Salt",
        "1 tsp Apple cider vinegar",
        "5 tbsp Vegetable oil",
        "2 Eggs"
    ],
    "instructions": [
        "Measure out the warm water into a jug - it should be at skin temperature - i.e. you can't really feel the heat when you dip your finger in. Stir the sugar into the warm water and until dissolved, then add the yeast and stir again. Leave in a warm spot for 5-10 minutes for the yeast to activate. It should form a lovely froth on top when it's ready.",
        "Add the gluten free bread flour, xanthan gum and salt to a large mixing bowl and stir to mix together.",
        "In a separate mug or bowl, add the eggs, oil and vinegar and lightly whisk to combine.",
        "Once the yeast/water mixture is active (frothy), add it to the flour along with the egg/oil mixture. Using a wooden spoon, beat the mixture together vigorously to combine it into a thick, sticky dough.",
        "Oil a 2lb loaf tin then pour the dough into it. You may need to use oiled fingers to scrape out the dough as it can be quite sticky, and to gently smooth down the top of the dough in the tin so it's even. Loosely cover the tin with oiled clingfilm and leave in a warm spot to prove. It will take about 25-30 minutes and should rise to the top of the tin.",
        "Preheat the oven to 200'C (Fan 180'C / Gas 6). Once the dough has risen to the top of the tin, remove the clingfilm and place in the centre of the oven. Bake for 55-60 minutes until it is risen and golden (tip - if the top of loaf starts to catch then place some foil over it). You'll know the bread is done if you tip it out of the tin and tap on each surface - it should sound hard and hollow.",
        "Leave the loaf to cool in the tin on a cooling rack for at least 30 minutes before cutting into it. Slice up and enjoy while warm and fresh."
    ]
}